// pages/kinds/kinds.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    partition: [{
      index: 1,
      src: '../img/hall.png',
      title: "交流大厅"
    }, {
      index: 2,
      src: '../img/paper.png',
      title: "考试交流"
    }, {
      index: 3,
      src: '../img/work.png',
      title: "留学工作"
    }, {
      index: 4,
      src: '../img/square.png',
      title: "动态广场"
    }, {
      index: 5,
      src: '../img/advisory.png',
      title: "留言/解答"
    }, {
      index: 6,
      src: '../img/consultant.png',
      title: "专属客服"
    }],
    attention: [{
      index: 1,
      src: "../img/video.png",
      title: "ACT数学全解（10）",
      coment: "四川轻化工大学名师🐟🕊🕊为你讲解ACT数学，全方位剖析。",
      who: "🐟🕊🕊",
      when: "9102年13月32日"
    }, {
      index: 2,
      src: "../img/video.png",
      title: "ACT数学全解（11）",
      coment: "四川轻化工大学名师🐟🕊🕊为你讲解ACT数学，全方位剖析。",
      who: "🐟🕊🕊",
      when: "9102年13月32日"
    }, {
      index: 3,
      src: "../img/video.png",
      title: "ACT数学全解（12）",
      coment: "四川轻化工大学名师🐟🕊🕊为你讲解ACT数学，全方位剖析。",
      who: "🐟🕊🕊",
      when: "9102年13月32日"
    }, {
      index: 4,
      src: "../img/lable.png",
      title: "《论数学的重要新》",
      coment: "四川轻化工大学名师🐟🕊🕊奋笔疾书，为我们讲解数学的重要性",
      who: "🐟🕊🕊",
      when: "9102年13月32日"
    }, {
      index: 5,
      src: "../img/hot.png",
      title: "美国这些职位最火热",
      coment: "四川轻化工大学名师🐟🕊🕊带你找工作，留学不花家里一分钱。",
      who: "🐟🕊🕊",
      when: "9102年13月32日"
    }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})